Revit 2024 API
ConnectorElement.AssignAsPrimary Method
 Assign a connector as a primary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void AssignAsPrimary()
Visual Basic
Public Sub AssignAsPrimary
Visual C++
public:
void AssignAsPrimary()
Remarks
 This method is used to promote this connector as primary, and the rest of connectors in this system will be assigned as secondary.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when fail to assign this connector as primary.
See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace